Documents/СведенияДляФРМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СведенияДляФРМО</Name>
			<Comment>АПК:93 представления объекта и списка совпадают</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИНОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерШтатногоРасписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгрузкаПроведена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШтатныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПозицияШтатногоРасписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПодразделения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПодразделения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОтделенияИлиКабинета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеОтделенияИлиКабинета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьПоФедСправочникуКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностьПоФедСправочникуНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСтавок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Занято</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗанятоПоОсновномуМестуРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗанятоПоВнешнемуСовместительству</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФизлиц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВакансий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИдентификаторыОбъектовДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыОбъектовДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МоментВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделМедрегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:DocumentRef.УтверждениеШтатногоРасписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеШтатногоРасписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбразованиеФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СведенияДляФРМО/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ЗапрашиваемыеЗначения = Новый Структура;
		ЗапрашиваемыеЗначения.Вставить("Организация", "Объект.Организация");
		ЗапрашиваемыеЗначения.Вставить("Ответственный", "Объект.Ответственный");
		
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗапрашиваемыеЗначения);
		
		ЗаполнитьНастройкиОрганизацииНаСервере();
		
		ПриПолученииДанныхНаСервере();
	Иначе
		НастройкиОрганизации = МедицинскиеРегистры.ПолучитьНастройкиОрганизации(Объект.Организация);
		Сертификат = НастройкиОрганизации.Сертификат;
		ИдентификаторИнформационнойСистемы = НастройкиОрганизации.ИдентификаторИнформационнойСистемы;
	КонецЕсли;
	
	ЗаполнитьИсточникиИзмененийШтатногоРасписания();
	
	
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсточникиИзмененийШтатногоРасписания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИзменениеШтатногоРасписания.ДатаВступленияВСилу КАК ДатаНачалаДействия,
	|	ЕСТЬNULL(ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментВыгрузки, ДАТАВРЕМЯ(1, 1, 1)) <= ЕСТЬNULL(ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ТребуетВыгрузки
	|ПОМЕСТИТЬ ВТДатыНачалаДействия
	|ИЗ
	|	Документ.ИзменениеШтатногоРасписания КАК ИзменениеШтатногоРасписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыОбъектовДляФедеральныхМедрегистров
	|		ПО (ИдентификаторыОбъектовДляФедеральныхМедрегистров.Объект = ЗНАЧЕНИЕ(Документ.УтверждениеШтатногоРасписания.ПустаяСсылка))
	|			И (ИдентификаторыОбъектовДляФедеральныхМедрегистров.ДатаСобытия = ИзменениеШтатногоРасписания.ДатаВступленияВСилу)
	|ГДЕ
	|	ИзменениеШтатногоРасписания.Проведен
	|	И ИзменениеШтатногоРасписания.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УтверждениеШтатногоРасписания.МесяцВступленияВСилу,
	|	ЕСТЬNULL(ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментВыгрузки, ДАТАВРЕМЯ(1, 1, 1)) <= ЕСТЬNULL(ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментИзменения, ДАТАВРЕМЯ(1, 1, 1))
	|ИЗ
	|	Документ.УтверждениеШтатногоРасписания КАК УтверждениеШтатногоРасписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыОбъектовДляФедеральныхМедрегистров
	|		ПО (ИдентификаторыОбъектовДляФедеральныхМедрегистров.Объект = ЗНАЧЕНИЕ(Документ.УтверждениеШтатногоРасписания.ПустаяСсылка))
	|			И (ИдентификаторыОбъектовДляФедеральныхМедрегистров.ДатаСобытия = УтверждениеШтатногоРасписания.МесяцВступленияВСилу)
	|ГДЕ
	|	УтверждениеШтатногоРасписания.Проведен
	|	И УтверждениеШтатногоРасписания.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТДатыНачалаДействия.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ВТДатыНачалаДействия.ТребуетВыгрузки КАК ТребуетВыгрузки
	|ИЗ
	|	ВТДатыНачалаДействия КАК ВТДатыНачалаДействия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачалаДействия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДатыНачалаДействия";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	ВсеИзменения = Запрос.Выполнить().Выгрузить();
	Источники.Очистить();
	КоличествоДокументов = ВсеИзменения.Количество();
	ДатаОкончания = Дата('21000101');
	Для ТекущийНомер = (1 - КоличествоДокументов) По 0 Цикл 
		Изменение = ВсеИзменения[-ТекущийНомер];
		Если Изменение.ТребуетВыгрузки Или Изменение.ДатаНачалаДействия=Объект.ДатаНачалаДействия Тогда 
			НовыйИсточник = Источники.Добавить();
			НовыйИсточник.ДатаНачалаДействия = Изменение.ДатаНачалаДействия;
			НовыйИсточник.ДатаОкончанияДействия = НачалоДня(НачалоДня(ДатаОкончания) - 1);
		КонецЕсли;
		ДатаОкончания = Изменение.ДатаНачалаДействия;
	КонецЦикла;
	Элементы.ДатаНачалаДействияИзмененийШтатногоРасписания.СписокВыбора.Очистить();
	Элементы.ДатаНачалаДействияИзмененийШтатногоРасписания.СписокВыбора.ЗагрузитьЗначения(Источники.Выгрузить(, "ДатаНачалаДействия").ВыгрузитьКолонку("ДатаНачалаДействия"));

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьМоментВыгрузки(Объект.ДатаНачалаДействия);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения 
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаДействияИзмененийШтатногоРасписанияПриИзменении(Элемент)
	Объект.ШтатныеЕдиницы.Очистить();
	Объект.ВыгрузкаПроведена = Ложь;
	ЗаполнитьДанныеШтатногоРасписанияНаСервере(Объект.ДатаНачалаДействия);
	ЗаполнитьНаКлиенте();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеШтатногоРасписанияНаСервере(ВыбраннаяДатаНачалаДействия)
	
	ОтобранныеСтрокиШР = Источники.НайтиСтроки(Новый Структура("ДатаНачалаДействия", ВыбраннаяДатаНачалаДействия));
	Если ОтобранныеСтрокиШР.Количество()>0 Тогда 
		ТекущиеДанныеШР = ОтобранныеСтрокиШР[0];
		Объект.НомерШтатногоРасписания = Формат(ТекущиеДанныеШР.ДатаНачалаДействия, "ДФ='ггггММдд'");
		Объект.ДатаУтверждения = ТекущиеДанныеШР.ДатаНачалаДействия;
		Объект.ДатаОкончанияДействия = ТекущиеДанныеШР.ДатаОкончанияДействия;
	КонецЕсли;
	
	ЗаполнитьМоментВыгрузки(ВыбраннаяДатаНачалаДействия);
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьМоментВыгрузки(ДатаНачалаДействия)
	
	МоментВыгрузки = Дата('00010101');
	МоментВыгрузкиТекст = НСтр("ru = 'Выгрузка не проводилась'");
	
	Если ЗначениеЗаполнено(ДатаНачалаДействия) Тогда 
		Набор = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(Документы.УтверждениеШтатногоРасписания.ПустаяСсылка());
		Набор.Отбор.ДатаСобытия.Установить(ДатаНачалаДействия);
		Набор.Прочитать();
		Если Набор.Количество()>0 Тогда
			МоментВыгрузки = Набор[0].МоментВыгрузки;
			МоментВыгрузкиТекст = СтрШаблон(НСтр("ru = 'Выгрузка проводилась %1'"), МоментВыгрузки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтаФорма);
	ЗаполнитьНастройкиОрганизацииНаКлиенте();
	ЗаполнитьИсточникиИзмененийШтатногоРасписания();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтаФорма);
	ЗаполнитьИсточникиИзмененийШтатногоРасписания();
КонецПроцедуры

&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	СертификатПриИзмененииНаСервере(Объект.Организация, Сертификат);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ВыгрузитьВФРМО(Команда)
	ОчиститьСообщения();
	ВыгрузитьВФРМОНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ЗаполнениеДокумента

&НаСервереБезКонтекста
Процедура СертификатПриИзмененииНаСервере(Организация, Сертификат = Неопределено)
	
	Если Не ЗначениеЗаполнено(Организация) Или Не ЗначениеЗаполнено(Сертификат) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОрганизации = МедицинскиеРегистры.СоздатьПустыеНастройкиОрганизации();
	НастройкиОрганизации.Сертификат = Сертификат;
	
	МедицинскиеРегистры.СохранитьНастройкиОрганизации(Организация, НастройкиОрганизации);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиОрганизацииНаСервере()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		НастройкиОрганизации = ПрочитатьНастройкиОрганизации(Объект.Организация);
		Объект.УИНОрганизации = НастройкиОрганизации.ИдентификаторДляМедрегистров;
		Сертификат = НастройкиОрганизации.Сертификат;
		ИдентификаторИнформационнойСистемы = НастройкиОрганизации.ИдентификаторИнформационнойСистемы;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьНастройкиОрганизацииНаКлиенте()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		НастройкиОрганизации = ПрочитатьНастройкиОрганизации(Объект.Организация);
		Объект.УИНОрганизации = НастройкиОрганизации.ИдентификаторДляМедрегистров;
		Сертификат = НастройкиОрганизации.Сертификат;
		ИдентификаторИнформационнойСистемы = НастройкиОрганизации.ИдентификаторИнформационнойСистемы;
	КонецЕсли;
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПрочитатьНастройкиОрганизации(Организация)
	Возврат МедицинскиеРегистры.ПолучитьНастройкиОрганизации(Организация)
КонецФункции 

&НаКлиенте
Процедура ЗаполнитьНаКлиенте()

	Результат = РезультатЗаполненияВДлительнойОперации();
	
	Если Результат.ЗаданиеВыполнено Тогда
		
		ОповеститьОбИзменении(Объект.Ссылка);
		
	Иначе
		
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища		 = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатЗаполненияВДлительнойОперации()
	
	ПараметрыЗаполнения = Новый Структура("ДанныеДляЗаполнения,Организация,ДатаАктуальности");
	ПараметрыЗаполнения.Организация = Объект.Организация;
	ПараметрыЗаполнения.ДатаАктуальности = Объект.ДатаНачалаДействия;
	
	НаименованиеЗадания = НСтр("ru = 'Заполнение документа ""Сведения для ФРМО""'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Документы.СведенияДляФРМО.ПодготовитьДанныеДляЗаполнения",
		ПараметрыЗаполнения,
		НаименованиеЗадания);
	
	АдресХранилища = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗаполнениеПослеВыполненияДлительнойОперации();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнениеПослеВыполненияДлительнойОперации()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьИзХранилища(АдресХранилища);
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
				ЗаполнениеПослеВыполненияДлительнойОперации();
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
					"Подключаемый_ПроверитьВыполнениеЗадания",
					ПараметрыОбработчикаОжидания.ТекущийИнтервал,
					Истина);
			КонецЕсли;
				
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		
		СообщенияПользователю = СообщенияФоновогоЗадания(ИдентификаторЗадания);
		Если СообщенияПользователю <> Неопределено Тогда
			
			Для Каждого СообщениеФоновогоЗадания Из СообщенияПользователю Цикл
				СообщениеФоновогоЗадания.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервереБезКонтекста
Функция СообщенияФоновогоЗадания(ИдентификаторЗадания)
	
	СообщенияПользователю = Новый Массив;
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если ФоновоеЗадание <> Неопределено Тогда
		СообщенияПользователю = ФоновоеЗадание.ПолучитьСообщенияПользователю();
	КонецЕсли;
	
	Возврат СообщенияПользователю;
	
КонецФункции

#КонецОбласти

#Область ВыгрузкаВФРМО

&НаКлиенте
Процедура ВыгрузитьВФРМОНаКлиенте() 
	
	Если Модифицированность Тогда
		Если Не Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Идентификатор = Неопределено;
	КонфликтующееШтатноеРасписаниеФРМО = Неопределено;
	ПараметрыСервиса = ПараметрыСервиса();
	ПараметрыВызова = GetOrgStaff(Объект.УИНОрганизации);
	ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
	ОтветСервиса = ВызватьМетод(ТокенДоступа, ПараметрыВызова);
	Если ОтветСервиса.КодСостояния<400 Тогда 
		Если ТипЗнч(ОтветСервиса.Контент)=Тип("Массив") Тогда
			Для Каждого ШтатноеРасписаниеФРМО Из ОтветСервиса.Контент Цикл 
				ИдентификаторФРМО = ШтатноеРасписаниеФРМО.staffId;
				ДатаНачалаДействияФРМО = МедицинскиеРегистрыКлиент.ДатаИзUTC(ШтатноеРасписаниеФРМО.beginDate);
				ДатаОкончанияДействияФРМО = МедицинскиеРегистрыКлиент.ДатаИзUTC(ШтатноеРасписаниеФРМО.endDate);
				Если ДатаНачалаДействияФРМО=Объект.ДатаНачалаДействия Тогда
					Идентификатор = ИдентификаторФРМО;
					ЗаписатьРезультатВыгрузки(Объект.ДатаНачалаДействия, Идентификатор, Неопределено, Неопределено);
				ИначеЕсли ДатаНачалаДействияФРМО<Объект.ДатаНачалаДействия И Объект.ДатаНачалаДействия<=ДатаОкончанияДействияФРМО Тогда 
					КонфликтующееШтатноеРасписаниеФРМО =  ШтатноеРасписаниеФРМО;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
		СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Получение данных штатного расписания: %1'"), ОтветСервиса.СообщениеОбОшибкеПользователю);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю);
	КонецЕсли;

	StaffData = StaffData();
	StaffData.staffNum = Объект.НомерШтатногоРасписания;
	StaffData.staffCreateDate = Объект.ДатаУтверждения;
	StaffData.beginDate = Объект.ДатаНачалаДействия;
	StaffData.endDate = Объект.ДатаОкончанияДействия;
	StaffData.staffDetails = Новый Массив;
	
	Для Каждого Позиция Из Объект.ШтатныеЕдиницы Цикл  
	    staffDetails = staffDetails();
		staffDetails.nrPmuDepartId = Позиция.ИдентификаторПодразделения;
		staffDetails.departName = Позиция.НаименованиеПодразделения;
		staffDetails.nrPmuDepartHospitalSubdivisionId = ?(ПустаяСтрока(Позиция.ИдентификаторОтделенияИлиКабинета), Неопределено, Позиция.ИдентификаторОтделенияИлиКабинета);
		staffDetails.hospitalName = ?(ПустаяСтрока(Позиция.НаименованиеОтделенияИлиКабинета), Неопределено, Позиция.НаименованиеОтделенияИлиКабинета);
		staffDetails.postFedCode.code = ?(ПустаяСтрока(Позиция.ДолжностьПоФедСправочникуКод), Неопределено, Позиция.ДолжностьПоФедСправочникуКод);
		staffDetails.postFedCode.name = ?(ПустаяСтрока(Позиция.ДолжностьПоФедСправочникуНаименование), Неопределено, Позиция.ДолжностьПоФедСправочникуНаименование);
		staffDetails.post.code = ?(ПустаяСтрока(Позиция.ДолжностьКод), Неопределено, Позиция.ДолжностьКод);
		staffDetails.post.name = ?(ПустаяСтрока(Позиция.ДолжностьНаименование), Неопределено, Позиция.ДолжностьНаименование);
		staffDetails.flCount = Позиция.КоличествоФизлиц;
		staffDetails.averageAge = 0;
		staffDetails.rate = Позиция.КоличествоСтавок;
		staffDetails.busyRate = Позиция.Занято;
		staffDetails.busyRateMain = Позиция.ЗанятоПоОсновномуМестуРаботы;
		staffDetails.externalRate = Позиция.ЗанятоПоВнешнемуСовместительству;
		staffDetails.vacancy = Позиция.КоличествоВакансий;
		staffDetails.staffNote = Позиция.Описание;
		StaffData.staffDetails.Добавить(staffDetails);
	КонецЦикла;
	
	ВыгрузкаДопускается = Истина;
	Если ТипЗнч(КонфликтующееШтатноеРасписаниеФРМО)=Тип("Структура") Тогда 
		ДатаНачала = МедицинскиеРегистрыКлиент.ДатаИзUTC(КонфликтующееШтатноеРасписаниеФРМО.beginDate);
		НоваяДатаОкончания = НачалоДня(НачалоДня(Объект.ДатаНачалаДействия) - 1);
		КонфликтующееШтатноеРасписаниеФРМО.staffCreateDate = МедицинскиеРегистрыКлиент.ДатаИзUTC(КонфликтующееШтатноеРасписаниеФРМО.staffCreateDate);
		КонфликтующееШтатноеРасписаниеФРМО.beginDate = ДатаНачала;
		КонфликтующееШтатноеРасписаниеФРМО.endDate = НоваяДатаОкончания;
		Для Каждого Позиция Из КонфликтующееШтатноеРасписаниеФРМО.staffDetails Цикл
			Позиция.postFedCode.code = Формат(Позиция.postFedCode.code, "ЧГ=0; ЧН=");
			Позиция.post.code = Формат(Позиция.post.code, "ЧГ=0; ЧН=");
		КонецЦикла;
		ПараметрыВызова = PostPutOrgStaff(Объект.УИНОрганизации, КонфликтующееШтатноеРасписаниеФРМО.staffId, КонфликтующееШтатноеРасписаниеФРМО);
		ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
		ОтветСервиса = ВызватьМетод(ТокенДоступа, ПараметрыВызова);
		Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
			СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Замена даты окончания штатного расписания: %1'"), ОтветСервиса.СообщениеОбОшибкеПользователю);
			ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю);
			ВыгрузкаДопускается = Ложь;
		Иначе 
			ВыгрузкаДопускается = ЗаписатьНовуюДатуОкончания(ДатаНачала, НоваяДатаОкончания, Объект.Организация);
			Если Не ВыгрузкаДопускается Тогда 
				СообщениеОбОшибкеПользователю = НСтр("ru = 'Не удалось сделать замену даты окончания предыдущего штатного расписания в документе выгрузки.
				|Возможно, он открыт для редактирования.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ВыгрузкаДопускается Тогда
		
		Объект.ВыгрузкаПроведена = Истина;
		ПараметрыВызова = PostPutOrgStaff(Объект.УИНОрганизации, Идентификатор, StaffData);
		ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
		ОтветСервиса = ВызватьМетод(ТокенДоступа, ПараметрыВызова);
		Если ОтветСервиса.КодСостояния<400 Тогда 
			Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
				Идентификатор = ОтветСервиса.Контент.entityId;
				МоментВыгрузки = МоментВыгрузкиНаСервере();
				МоментВыгрузкиТекст = СтрШаблон(НСтр("ru = 'Выгрузка проведена %1'"), МоментВыгрузки);
				ЗаписатьРезультатВыгрузки(Объект.ДатаНачалаДействия, Идентификатор, МоментВыгрузки, ПараметрыВызова.РазделМедрегистра);
			ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
				МоментВыгрузки = МоментВыгрузкиНаСервере();
				МоментВыгрузкиТекст = СтрШаблон(НСтр("ru = 'Выгрузка проведена %1'"), МоментВыгрузки);
				ЗаписатьРезультатВыгрузки(Объект.ДатаНачалаДействия, Идентификатор, МоментВыгрузки, ПараметрыВызова.РазделМедрегистра);
			Иначе 
				Объект.ВыгрузкаПроведена = Ложь;
			КонецЕсли;
		Иначе 
			Объект.ВыгрузкаПроведена = Ложь;
		КонецЕсли;
		Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
			СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Выгрузка штатного расписания: %1'"), ОтветСервиса.СообщениеОбОшибкеПользователю);
			ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю);
		КонецЕсли;
		
		Записать();
		
	КонецЕсли;
			
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МоментВыгрузкиНаСервере()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Функция ТокенДоступа(ПараметрыСервиса)
	АдресСервиса = ?(ПараметрыСервиса.ИспользоватьЗащищенноеСоединение, "https://", "http://") + ПараметрыСервиса.Адрес + ПараметрыСервиса.ТочкаДоступа;
	Возврат МедицинскиеРегистрыКлиент.ТокенДоступа(ДанныеСертификата(Сертификат), Пароль, АдресСервиса, МоментВыпуска(), ИдентификаторИнформационнойСистемы);
КонецФункции

&НаСервереБезКонтекста
Функция МоментВыпуска() Экспорт
	Возврат МедицинскиеРегистры.МоментВыпуска();
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеСертификата(СертификатСсылка)
	Возврат МедицинскиеРегистры.ДанныеСертификата(СертификатСсылка);
КонецФункции

&НаСервереБезКонтекста
Функция ВызватьМетод(ТокенДоступа, ПараметрыВызова)
	Возврат МедицинскиеРегистры.ВызватьМетод(ТокенДоступа, ПараметрыВызова);
КонецФункции

&НаСервереБезКонтекста
Функция ПараметрыСервиса()
	Возврат МедицинскиеРегистры.ПараметрыСервиса();
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьРезультатВыгрузки(ДатаСобытия, Идентификатор, МоментВыгрузки, РазделМедрегистра)
	
	Набор = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Документы.УтверждениеШтатногоРасписания.ПустаяСсылка());
	Набор.Отбор.ДатаСобытия.Установить(ДатаСобытия);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		РезультатВыгрузки = Набор.Добавить();
		РезультатВыгрузки.Объект = Документы.УтверждениеШтатногоРасписания.ПустаяСсылка();
		РезультатВыгрузки.ДатаСобытия = ДатаСобытия;
	Иначе
		РезультатВыгрузки = Набор[0];
	КонецЕсли;
	РезультатВыгрузки.Идентификатор = Идентификатор;
	Если МоментВыгрузки<>Неопределено Тогда 
		РезультатВыгрузки.МоментВыгрузки = МоментВыгрузки;
	КонецЕсли;
	Если РазделМедрегистра<>Неопределено Тогда 
		РезультатВыгрузки.РазделМедрегистра = РазделМедрегистра;
	КонецЕсли;
	Набор.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписатьНовуюДатуОкончания(ДатаНачала, НоваяДатаОкончания, Организация)
	
	ДокументИзмененУспешно = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияДляФРМО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СведенияДляФРМО КАК СведенияДляФРМО
		|ГДЕ
		|	СведенияДляФРМО.Организация = &Организация
		|	И СведенияДляФРМО.ДатаНачалаДействия = &ДатаНачалаДействия";
	
	Запрос.УстановитьПараметр("ДатаНачалаДействия", ДатаНачала);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДокументДляЗаписи = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДокументЗаблокирован = Истина;
		Попытка
		  ДокументДляЗаписи.Заблокировать();
		Исключение
			ДокументЗаблокирован = Ложь;
			ДокументИзмененУспешно = Ложь;
		КонецПопытки;
		
		Если ДокументЗаблокирован Тогда 
			ДокументДляЗаписи.ДатаОкончанияДействия = НоваяДатаОкончания;
			ДокументДляЗаписи.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДокументИзмененУспешно;
	
КонецФункции

&НаСервереБезКонтекста
Функция GetOrgStaff(oid)
	Возврат МедицинскиеРегистрыФРМО.GetOrgStaff(oid);
КонецФункции

&НаСервереБезКонтекста
Функция StaffData()
	Возврат МедицинскиеРегистрыФРМО.StaffData();
КонецФункции

&НаСервереБезКонтекста
Функция StaffDetails()
	Возврат МедицинскиеРегистрыФРМО.StaffDetails();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutOrgStaff(oid, entityId, StaffData)
	Возврат МедицинскиеРегистрыФРМО.PostPutOrgStaff(oid, entityId, StaffData);
КонецФункции

#КонецОбласти

#Область КлючевыеРеквизитыЗаполненияФормы
// Подключение универсальных механизмов.
&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ОписаниеКлючевыхРеквизитов = Неопределено;
	ТаблицыОчищаемыеПриИзменении = Неопределено;
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтаФорма, ОписаниеКлючевыхРеквизитов);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма, , ОписаниеКлючевыхРеквизитов, ТаблицыОчищаемыеПриИзменении);
	
КонецПроцедуры

// Функция возвращает описание таблиц формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Объект.ШтатныеЕдиницы");
	Массив.Добавить("Источники");
	
	Возврат Массив
	
КонецФункции 

// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Организация", Нстр("ru = 'организации'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Дата", Нстр("ru = 'даты документа'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "ДатаНачалаДействия", Нстр("ru = 'даты начала действия измененного штатного расписания'")));
	
	Возврат Массив
	
КонецФункции

#КонецОбласти

#КонецОбласти
